import java.util.Arrays;
import java.util.Scanner;

public class Seminar_1 {
    public static void main(String[] args) {

//        Дан массив двоичных чисел. Вывести на экран максимальное число подряд идущих чисел
//        int[] array = {1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1};
//        int count_max = 0;
//        int count = 0;
//        int item = 0;
//        for (int i = 0; i < array.length; i++) { // тут лучше использовать foreach
//            if (array[i] != item){
//                item = array[i];
//                count = 0;
//            }
//            count_max = count_max < ++count ? count: count_max;
//        }
//        System.out.println("Максимальное количество подряд идущих элементов = " + count_max);

//        Дан Массив целых чисел и задано целое число, встречающееся несколько раз в этом массиве
//        Нужно переставить все эти числа в конец массива
//        Например [1,2,3,4,5,2,3,4,2,3,2,5], 3 -> [1,2,4,5,2,4,2,2,5,3,3,3]
//        int[] array = {1, 2, 3, 3, 5, 2, 3, 4, 2, 3, 2, 5};
//        System.out.println(Arrays.toString(array));
//        int number = 3;
//        for (int i = 0; i < array.length - 1; i++) {
//            for (int j = i + 1; j < array.length; j++) {
//                if (array[i] == number) {
//                    array[i] = array[j];
//                    array[j] = number;
//                }
//            }
//        }
//        System.out.println(Arrays.toString(array));

    }
}